[
{
        "activity": {
            "total_reads": 2
        },
        "_id": "67a86c890e17a292d575df9b",
        "blog_id": "Women-In-Labor-Why-Are-Women-Peripheral-In-The-Lebanese-Market-What-are-The-Solutions-iHaowEGjrMQRhZRosL1wP",
        "title": "Women In Labor: Why Are Women Peripheral In The Lebanese Market? What are The Solutions?",
        "banner": "http://res.cloudinary.com/dlhedrwu6/image/upload/v1739090882/l_lD285PgASdNJWRZ4hzP-1739090881956.jpg",
        "description": "The Lebanese women suffer from many problems in the Lebanese labor market, displayed by many means, but caused by one root basically: the Lebanese regime, and any misdiagnosis of the real root of ...",
        "content": [
            {
                "time": 1739090979632,
                "blocks": [
                    {
                        "id": "Vj1ZRPEh9P",
                        "type": "paragraph",
                        "data": {
                            "text": "he Lebanese women suffer from many problems in the Lebanese labor market, displayed by many means, but caused by one root basically: the Lebanese regime, and any misdiagnosis of the real root of this problem misleads this major topic without any solution. Despite the fact that the vast majority of women are sophisticated and educated, having at least a bachelor college degree, the Lebanese labor market constitutes of only 25% of females, and unfortunately, this 25% doesn't include any majors superior jobs that possesses power but most of females work in small companies and associations that are family-based."
                        }
                    },
                    {
                        "id": "fISuVEih3K",
                        "type": "paragraph",
                        "data": {
                            "text": "This issue can be explained by going deeper into the structure of the Lebanese families. The Lebanese house-holds expenditure constitutes of 68 % spent for clothing, food, transportation, housing, and education, out of which education makes 5% of the total household average expenditure. Moreover, it is realized that the unemployment rate for the Lebanese youth is 47% in 2022, while for the adults it's the half approximately, and the unemployment rates decreases as age of worker increases. Taking this into consideration, the youth has always had only 2 choices for survival, either surrender or immigration. The households always prefer to backup this plan by educating their children so they increase their opportunities of immigration. As a Lebanese youth, you either surrender to a certain political party and sell yourself for them as an ambassador, organizer, and an active member in their party in return of having a job in the Lebanese government or having contracts, bids, bonds with the government, or depositing money in banks and getting more than 14 % interest and many other facilities, or you simply immigrate and search for a job and a settlement in any foreign country. Unfortunately, Lebanon does not export anything rather than human-beings, that send back dollars and foreign currencies into the Lebanese economy which constitutes of a major part of this corrupt economy."
                        }
                    },
                    {
                        "id": "n9pSZbyh9m",
                        "type": "paragraph",
                        "data": {
                            "text": "Due to this mere fact, and since most of women are well-educated, the Lebanese households invest so much in educating their children in order to prepare them well for immigration, and this investment goes beyond money, but the Lebanese women invest their lives and careers and sometimes cease their capabilities and ambitions, but rather serve as house-makers whom their first responsibility is fostering their children and tutoring them. This explains why the majority of educational staffs in Lebanon are of the feminine gender, since it is more preferable in the Lebanese mindsets to get tutored and educated by females."
                        }
                    },
                    {
                        "id": "3HAq11NzU2",
                        "type": "paragraph",
                        "data": {
                            "text": "Moreover, the Lebanese feminine labor force suffers from a structural problem which derivates directly by the Lebanese corrupt regime. This regime was so cunning and smart and was always able to hide behind, creating conspiracy theories to keep the Lebanese citizens attention away from the main problem. This regime doesn't give the Lebanese women their right to have a civil registry, but instead each Lebanese women is registered on her father's registration and then on her husband's civil record. This explain one extremist example: many Lebanese households see their daughters as products that will be transported to another household, her husband, and that she is of no main value, since any achievement that she will achieve will be recorded in her husband's credit, thus serving into depriving them from inheritance or other lawful shares. This issue can be solved by having periodic census of the Lebanese population, which will allow women to be registered on the civil record they decide. It is not a coincidence that this regime is still using the French census that was conducted in 1932., for this census conflicts with their sectarian existence. This sectarian regime does not see its citizens as people with rights, but as votes when election happens, and as sects in other periods. Having a civil state in Lebanon, as the law states, can resolve many problems, which feminist problems are part of them. In addition, upon a request of the Lebanese government, a study from the world bank deduced that the Syrian refugees’ conflict in Lebanon will create a 40% increase in the labor force, thus a 16% decrease in wages, 60-200% increase in immigration rate, 3% decrease in GDP per capita, and an increase of taxation. Those numbers were proved right from 2013 till 2022, and this is to be added to major problems that Lebanese workers suffer from, thus eliminating more the possibility of the resolving of women in labor market suffering."
                        }
                    },
                    {
                        "id": "8Lsl2FqWX9",
                        "type": "paragraph",
                        "data": {
                            "text": "Although the Lebanese government have signed the core international human rights treaties and treaty of international labor 1987, the Lebanese government created new specific laws against violence that domestic workers suffer from and against women violence, which is meaning-less since the basic treaties and laws serve the same mean, but it was a skillful play directed by this regime to create the illusion of progress. Besides, although the Lebanese law protects against domestic violence, in most cases, domestic violence is not displayed in court, thus, this law is meaningless. This violence is always justified by the abusers, since the regime in Lebanon does not see citizens as people with rights, but rather as sects, thus strengthening the mindset of papal authority."
                        }
                    },
                    {
                        "id": "LK3hS3nTrc",
                        "type": "paragraph",
                        "data": {
                            "text": "It is not a coincidence that the Lebanese government signed the treaty of international human rights shortly after the left wing took action in France. This treaty was just a kind of protocol for it leaves many deficiencies since it has many exceptions, such as workers in agriculture, domestic workers, workers in public sector, and workers in small family productions. Another deficiency is in the treaty of international labor 1987 since the government have signed and agreed on all of its points except the second point which indicates that workers have the right to make syndicates. This also leaves us to observe the miserable condition of syndicates in Lebanon, since syndicates can be a major threat for the sectarian regime. Syndicates reallocate people from being in sects to being as workers and social levels, and that is why there isn't a party of labor in Lebanon, but parties each representing a sect, a party that is unable to take any decision since any decision will benefit one social level and disadvantage another, since a sect is a sect for all social levels, unlike labor parties, and syndicates. To initiate a syndicate, you have to give the names of all members to the government, which puts any dynamic member in danger from being fired from his job if he was an active policy influencer in a certain syndicate. Hence, demanding special laws to protect against domestic violence will continue to classify women as peripheral, and continue to vague the main problem in Lebanon since the main issue that women in labor suffer from, is the same issue that all workers in Lebanese market suffer from which is the sectarian regime."
                        }
                    },
                    {
                        "id": "CjcIosIDer",
                        "type": "paragraph",
                        "data": {
                            "text": "This article states and concludes that all problems such as Syrian refugees’ crisis, retirement compensations, labor laws, domestic violence, etc are major problems that all make-up the practice of the Lebanese regime. Although that those are major problems, common Lebanese people do not have any opinion on their solution. Simply, the Lebanese citizen is not convinced that he has rights! Women in labor is not a simple issue, but an issue that is a part of a big crisis in the Lebanese labor force, which is aching from the sectarian root."
                        }
                    }
                ],
                "version": "2.30.2"
            }
        ],
        "tags": [
            "economy",
            "lebanese market",
            "labor",
            "women"
        ],
        "author": {
            "personal_info": {
                "name": "ali m. moumneh",
                "username": "ali2",
                "profile_img": "http://res.cloudinary.com/dlhedrwu6/image/upload/v1733085425/VNu1WhaSG6u0V-RZ1Jb45-1733085425139.jpg"
            },
            "_id": "66b3b7d63cab83b43bddd060"
        },
        "publishedAt": "2025-02-09T08:51:21.892Z"
},
  {
        "activity": {
            "total_reads": 2
        },
        "_id": "67a86d8b47ecc1b1fbef81a0",
        "blog_id": "Venezuelan-Economic-Crisis-In-What-Aspects-Is-It-Related-to-The-Lebanese-Latter-LEs9iVNYjGJara7jIu2pB",
        "title": "Venezuelan Economic Crisis: In What Aspects Is It Related to The Lebanese Latter?",
        "banner": "http://res.cloudinary.com/dlhedrwu6/image/upload/v1739091246/stJ2Zj8sB_b0dXMdGnSwV-1739091246192.jpg",
        "description": "ince 2019, it has been discussed so frequently on the news, televisions, and political salons how is the Lebanese crisis, which was displayed in considerable inflation rates, similar to the ...",
        "content": [
            {
                "time": 1739091274242,
                "blocks": [
                    {
                        "id": "-8G-NurgsQ",
                        "type": "paragraph",
                        "data": {
                            "text": "Since 2019, it has been discussed so frequently on the news, televisions, and political salons how is the Lebanese crisis, which was displayed in considerable inflation rates, similar to the Venezuelan crisis. However, this is true to a certain extent since both countries suffer from high inflation rates, but on the other hand, both economies are completely different, and the roots of the crises are different as well."
                        }
                    },
                    {
                        "id": "RnNAUq17sg",
                        "type": "paragraph",
                        "data": {
                            "text": "In 1999, in Venezuela, Hugo Chavez was the president elected. Chavez was the beloved president in Venezuela. He decreased poverty and unemployment by half, improved education, and increased the national GDP. In 2004, the prices of oil were booming, thus, the Venezuelan economy booming too, with credit taken by Chavez indeed! Chavez was the savior of Venezuela in the perspectives of its people."
                        }
                    },
                    {
                        "id": "UcYmV831wv",
                        "type": "paragraph",
                        "data": {
                            "text": "However, in reality Chavez achievements were not sustainable at all, and many economists burden him all the responsibility of what happened. Chavez created a new economy which is totally dependent on oil prices. For his luck and fortune, during his presidency (1999-2013), oil prices were convenient to appear as a savior. After his presidency ended, a new president, Maduro, was elected, and due to the world economy fluctuation at that period, oil prices fell down in 2014. After peaking at $107.95 a barrel on June 20, 2014, petroleum prices plunged to $44.08 a barrel by January 28, 2015, a drop of 59.2 percent in a little over 7 months. Thanks to Chavez, the Venezuelan economy is now correlated to the oil market, and with failure of Maduro to adjust , hyperinflation occurred, and the crisis of the Venezuelan economy starts now!"
                        }
                    },
                    {
                        "id": "06qomOflvV",
                        "type": "paragraph",
                        "data": {
                            "text": "Due to hyperinflation, products and services that were nearly free at Chavez’s presidency, became un-accessible by more than 82% of the population. Products like food and medication are considered now luxurious products in Venezuela."
                        }
                    },
                    {
                        "id": "VSXBBN_7LZ",
                        "type": "paragraph",
                        "data": {
                            "text": "In a trial to fix the situation, Maduro fixed the $ rate for 1$=10Bolivars, but this rate was not accessible for anyone who was not in his military backbone, or of his allies. The real exchange rate was the black market one, 1$=12000Bolivars. The black-market rate represented 1200% of Maduro’s rate. Moreover, Maduro has given the military a privilege to import food supply of the country on his rate, and due to the corruption that Maduro created to keep him in power, the military forces sold those supplies at the black-market rates, making a fortune! Maduro’s allies and military cabinet made massive profits, which have set very good relations with Maduro, thus, keeping Maduro in power. A study in 2016, shows that more than 80% of the citizens demand Maduro out of the office of presidency, thus, the series of protests starts in Venezuela."
                        }
                    },
                    {
                        "id": "4Fr6rpR3MR",
                        "type": "paragraph",
                        "data": {
                            "text": "In 2015, after 2 years of the election of Maduro, the opposition, MUD, took 2/3 of the national assembly, which lead Maduro to pressure the supreme court to make several orders thus filling the national assembly with Maduro’s allies. After many protests, Maduro had to act with little democracy and some respect for law, he created a new assembly in 2017 ,National constituent assembly, which consists of one wing only, thus people cannot vote for any party other than Maduro’s allies. The elections took place and Maduro announced his self a president again. The Venezuelan government stated that more than 7M citizen voted, while others estimate that not more than 3M voted. Many revolutions initiated and spread around the country, but Maduro’s military allies hit with his fist of steel. More than 100 protesters died in one day stating that Maduro’s government doesn’t have any problem to create massacres to maintain there authorities."
                        }
                    },
                    {
                        "id": "zYAtfUuBbx",
                        "type": "paragraph",
                        "data": {
                            "text": "However, this crisis is not similar at all to Lebanon economic crisis, since:"
                        }
                    },
                    {
                        "id": "xQ5p6Fs2FY",
                        "type": "list",
                        "data": {
                            "style": "unordered",
                            "items": [
                                "Lebanese economy is a rentier one(no production) unlike the Venezuelan one, then Venezuela was able to receive foreign currencies by selling goods and services to the rest of the world, but this decreased thoroughly due to sanctions initiated by the United Nations and the United States as well, adding to it the decrease of oil prices, the overall revenue decreased by 60% approximately thus, the rate of bolivar printing was so speedy ,leaving the Venezuelan currency roughly worthless. On the other hand, the Lebanese economy does not suffer from any sanctions, but it did get affected somehow by the fluctuation of oil prices. So we can see that the money supply in BDL was 20000 billion dollars in 2007, and it increased to reach 30000 billion dollars in 2009, after an increase in oil prices in this interval of time. However, this happened due to banking services that are performed by the Lebanese sectors but not a productive one or a sustainable one, or a sector that can hold by own an entire economy without having strict regulations. The entire money supply in Lebanon was found by debt, and that is why we saw a prospering economy in the 90s after Paris 1 conference, by which the Lebanese government borrowed more than 10 billion dollars, and then increasing this debt so much. However, after 2010, Lebanon did not find any side willing to borrow him more money so it sold bonds to local banks in hope that they pay them back by borrowing from the IMF , this is what is called a Ponzi scheme!"
                            ]
                        }
                    },
                    {
                        "id": "7hw2YcjL5t",
                        "type": "list",
                        "data": {
                            "style": "unordered",
                            "items": [
                                "The political stance in Venezuela has a right wing and a left wing, unlike the Lebanese political reality which does not have a clear wing"
                            ]
                        }
                    }
                ],
                "version": "2.30.2"
            }
        ],
        "tags": [
            "economy",
            "venezuelan market",
            "lebanese economy",
            "lebanese market",
            "venezuelan economy",
            "economic crisis"
        ],
        "author": {
            "personal_info": {
                "name": "ali m. moumneh",
                "username": "ali2",
                "profile_img": "http://res.cloudinary.com/dlhedrwu6/image/upload/v1733085425/VNu1WhaSG6u0V-RZ1Jb45-1733085425139.jpg"
            },
            "_id": "66b3b7d63cab83b43bddd060"
        },
        "publishedAt": "2025-02-09T08:55:39.556Z"
},
  {
        "activity": {
            "total_reads": 2
        },
        "_id": "67a86f400e17a292d575dfae",
        "blog_id": "Economic-Warfare-The-Boycotting-Movement-Implications-on-Business-and-Corporates03T_OWucEcMPA-zylbvCn",
        "title": "Economic Warfare: The Boycotting Movement Implications on Business and Corporates",
        "banner": "http://res.cloudinary.com/dlhedrwu6/image/upload/v1739091610/5KCgxw98W2eD3HnVSwUqw-1739091610091.jpg",
        "description": "Economists have been stuffed with the power of the invisible hand in the economy and the “laissez-faire” concepts of Adam Smith and other capitalistic economists and philosophers. However, the ...",
        "content": [
            {
                "time": 1739091721226,
                "blocks": [
                    {
                        "id": "z1Jk1fCqVQ",
                        "type": "quote",
                        "data": {
                            "text": "Power that controls the economy should be in the hands of elected representatives of the people instead of an industrial oligarchy&nbsp;",
                            "caption": "William O. Douglas",
                            "alignment": "left"
                        }
                    },
                    {
                        "id": "OuUYFZNImA",
                        "type": "paragraph",
                        "data": {
                            "text": "Economists have been stuffed with the power of the invisible hand in the economy and the “laissez-faire” concepts of Adam Smith and other capitalistic economists and philosophers. However, the oligarchy created in these systems have always beaten the power of the invisible hands. In fact, oligarchs, the people with “the wealth” became the people in real power, whether implicitly or explicitly. Some narratives indicate that even Hitler have used German oligarch allies to reach the top of the pyramid."
                        }
                    },
                    {
                        "id": "bbT2vWx87c",
                        "type": "paragraph",
                        "data": {
                            "text": "In a nutshell, in the womb of capitalistic markets, powerful oligarchs have taken over the world and displayed economic colonialism in the MENA region. As a reaction to the war in Gaza, the Arabs, Muslims, and Pro-Palestinian movements have initiated boycotts against Western brands, especially those that support the Zionist state! Mainly, these brands include Nestle, Starbucks, KFC, McDonalds, Coca-Cola, Pepsi, Zara, and a diverse variety of other brands. However, was this boycotting movement beneficial?"
                        }
                    },
                    {
                        "id": "kOqCGVMY26",
                        "type": "paragraph",
                        "data": {
                            "text": "As the echoes of boycotts reverberate through the Middle East and North Africa (MENA), the impact on international economies is becoming increasingly apparent. The economic battleground, once dominated by global giants, is witnessing the rise of an Arab invisible hand challenging the established order. This silent protest of perceived pro-Israel stances or financial ties to Israel has transcended borders and is reshaping the dynamics of global commerce."
                        }
                    },
                    {
                        "id": "zrREs26Qve",
                        "type": "header",
                        "data": {
                            "text": "Financial Ripples Across the Globe:",
                            "level": 2
                        }
                    },
                    {
                        "id": "v6K0w0N2iv",
                        "type": "paragraph",
                        "data": {
                            "text": "McDonald's, a stalwart symbol of Western fast-food supremacy, grappled with a staggering loss of $6 billion in market value, spotlighting the profound financial repercussions of the boycott movement (CNBC, 2024). Western fast-food giants, including McDonald's, Starbucks, and KFC, find themselves thrust into the forefront of a grassroots boycott surging through Egypt, Jordan, Kuwait, and Morocco, transcending specific borders to become a regional wave (Reuters, 2023). Originating in Egypt, Jordan, Kuwait, and Morocco, the boycott's influence is now permeating other Arab nations, albeit with limited effects in Saudi Arabia and the UAE (Reuters, 2023). What began as a reaction to perceived support for the Zionist state has transformed into a sweeping roster, encompassing Nestle, Starbucks, KFC, McDonald's, Coca-Cola, Pepsi, Zara, and an array of other prominent brands (Reuters, 2023). Fueled by the influential force of social media, the boycott broadens its reach to include a myriad of companies and products, amplifying its impact across diverse industries (Reuters, 2023). Stirred by a sense of activism, shoppers are heeding the call to shift their loyalty towards local alternatives, reflecting a significant shift in consumer behavior (Reuters, 2023)."
                        }
                    },
                    {
                        "id": "0_xYYj70HQ",
                        "type": "header",
                        "data": {
                            "text": "Local Impact, Global Implications:",
                            "level": 2
                        }
                    },
                    {
                        "id": "Rc8J9diEwG",
                        "type": "paragraph",
                        "data": {
                            "text": "Protests at McDonald's and Starbucks in Jordan show that people are urging to support local brands as part of a social and political movement (Reuters, 2023). In response, McDonald's says they are sad about it, emphasizing that they welcome everyone and promise to help Gaza. Starbucks, on the other hand, claims that they're not taking sides, denying rumors that they support Israel (Reuters, 2023). This is not just about what companies say – it is affecting their sales too. McDonald's in Egypt reports that they are making less money and having a hard time covering their costs (Reuters, 2023). Even the companies that supply Starbucks and McDonald's in Egypt say they're selling about half as much as before, showing how global businesses and local economies are connected (Reuters, 2023). The impact is different in different places. In some countries, like Malaysia, a lot fewer people are going to McDonald's. But in others, the impact is not as clear, like in Saudi Arabia, the UAE, and Tunisia, where people are not as convinced that boycotting really helps Palestinians (Reuters, 2023). Lebanon, already facing challenges, is dealing with more problems because of the aftermath of bombings and military actions in the region (CNBC, 2024). Surprisingly, as Western brands struggle, Middle Eastern competitors like Starbucks and Coke are actually doing better because of the boycotts (Bloomberg, 2024). It's not just about sales; people are losing jobs because of this movement. Americana for F&amp;B, which includes KFC, Pizza Hut, and Hardees, had to let go of 100 employees (Megaphone, 2024). Even Starbucks in the USA is feeling the negative impact of the boycotts, showing that this movement is making waves beyond the Middle East (Raseef, 2024)."
                        }
                    },
                    {
                        "id": "dGYOE8hQzy",
                        "type": "header",
                        "data": {
                            "text": "Conclusion:",
                            "level": 2
                        }
                    },
                    {
                        "id": "4nc3tXQCVf",
                        "type": "paragraph",
                        "data": {
                            "text": "The MENA boycotts, initially sparked by geopolitical tensions, are proving to be a transformative force, challenging established economic paradigms, and paving the way for a recalibration of global commerce dynamics. As the movement continues to unfold, the true extent of its impact on international economies remains to be seen."
                        }
                    },
                    {
                        "id": "BpvCle6gMx",
                        "type": "paragraph",
                        "data": {
                            "text": "When international brands feel shame to support the Zionist state, when the Arab invisible hand stagnates the international economy, then, indeed the MENA spectates a new liberation from an economic colonialism that has been there for years! In a nutshell: boycotting has worked out!"
                        }
                    }
                ],
                "version": "2.30.2"
            }
        ],
        "tags": [
            "economy",
            "economic warfare",
            "boycott",
            "mena"
        ],
        "author": {
            "personal_info": {
                "name": "ali m. moumneh",
                "username": "ali2",
                "profile_img": "http://res.cloudinary.com/dlhedrwu6/image/upload/v1733085425/VNu1WhaSG6u0V-RZ1Jb45-1733085425139.jpg"
            },
            "_id": "66b3b7d63cab83b43bddd060"
        },
        "publishedAt": "2025-02-09T09:02:56.038Z"
    },
  {
        "activity": {
            "total_reads": 2
        },
        "_id": "67a86fda48b9fe5378711282",
        "blog_id": "Implications-on-International-Affairs-How-Did-the-War-Influence-Regional-Relations-ZvvZAL-W--tZ19-5ykqm9",
        "title": "Implications on International Affairs: How Did the War Influence Regional Relations?",
        "banner": "http://res.cloudinary.com/dlhedrwu6/image/upload/v1739091829/1C05-tzJ5uqWQR00NSg-0-1739091829820.jpg",
        "description": "midst the Palestinian-Israeli conflict, the MENA region has witnessed notable boycott movements alongside the Red Sea attacks. These events have contributed to the emergence of what is now ...",
        "content": [
            {
                "time": 1739091857519,
                "blocks": [
                    {
                        "id": "Yc0UbIMVQk",
                        "type": "paragraph",
                        "data": {
                            "text": "Amidst the Palestinian-Israeli conflict, the MENA region has witnessed notable boycott movements alongside the Red Sea attacks. These events have contributed to the emergence of what is now recognized as ongoing economic warfare. This form of conflict has altered the narrative regarding regional dynamics and influenced international relations perceptions."
                        }
                    },
                    {
                        "id": "a14EV89hNo",
                        "type": "paragraph",
                        "data": {
                            "text": "The boycott movements in the region have been characterized by concerted efforts to withhold economic support or engagement with entities perceived as detrimental to Arab interests, particularly concerning the Palestinian cause. On the other hand, the Red Sea attacks, which have disrupted trade routes and maritime activities in the region, have further escalated tensions, and have had severe economic impacts in the region. Consequently, the ongoing economic warfare, characterized by the boycott movement and trade disruptions through the Red Sea attacks has not only affected economic prosperity but also played a major role in questioning and reshaping diplomatic relations and alliances, influencing international dynamics as well."
                        }
                    },
                    {
                        "id": "F8-2uzECi1",
                        "type": "paragraph",
                        "data": {
                            "text": "On a different note, it is essential to highlight the current economic and political battle with the founding principles of the League of Arab States in 1945. The League was established to promote Arab unity and integration while addressing various challenges in the region, with a strong focus on resolving the Palestinian issue. The latter has long been a catalyst for common Arab action as the importance of the Palestinian cause was emphasized in 1964 through the establishment of the Palestinian Liberation Order (PLO) by the Arab League in 1964, which affirmed Palestine’s liberation as a common duty. Additionally, the League’s Khartoum resolution after the 1967 defeat outlined the ‘three nos” towards Israel. It is worth mentioning that the League has boycotted Israeli goods since 1948, with inconsistent enforcement due to territorial ambitions, Cold War dynamics, and intra-Arab rivalries. Yet, amidst the ongoing political and economic uncertainties in the region and the lack of proper action by the regional organization, it becomes important to question the role of the Arab League and Arab countries amidst the current war; could the Arab League recommit to its founding principles and actively advocate for the Palestinian cause once again?"
                        }
                    },
                    {
                        "id": "dADmFtUhRS",
                        "type": "paragraph",
                        "data": {
                            "text": "As the region grapples with ongoing economic and political turmoil, the League's role in promoting Arab solidarity and addressing common concerns remains paramount, yet complex due to different factors. It has been evident that the UAE, Bahrain, Egypt, and Jordan, prominent countries in the region have normalized ties with Israel even before the ongoing war. However, the October 7th attack in Gaza has changed the narratives and approach of political relations in the region. A prominent example is the situation in the Gulf, particularly the Saudi-Israel rapprochement where under the leadership of Crown Prince Mohammed bin Salman, Saudi Arabia has shown a keen interest in monitoring and assessing the ongoing normalization process between Israel and the Arab Gulf states."
                        }
                    },
                    {
                        "id": "t213ZOlwps",
                        "type": "paragraph",
                        "data": {
                            "text": "Saudi Arabia's public warming of ties with Israel has been a gradual process. In 2018, senior Israeli and Saudi officials met openly for the first time in Washington during a Counter-Violent Extremist Organizations Conference. Additionally, following the normalization of ties between Israel and the UAE, Saudi Arabia permitted Israeli flights traveling from Israel to the UAE to pass through its airspace. In a September 2023 interview, the Crown Prince stated his aspiration for Israelis to have a recognized role in Middle Eastern politics, contingent upon improvements in the lives of Palestinians. Additionally, the UAE and Bahrain, prominent countries in the Persian Gulf, had already moved forward with normalization under the \"Abraham Accords\" in September 2020. In fact, there is a major free trade agreement along with alliances and booming tourism of Israelis in the UAE, which has been signaling normalization in the region. Due to Gulf’s influential position in the Arab and Islamic spheres, U.S. officials have been focusing on achieving relations in the region, specifically, Israel-Saudi normalization to fully integrate Israel into the region. However, the October 7th massacre in Gaza disrupted the long-running U.S effort to ensure the normalization of relations between Israel and Saudi Arabia and questioned the future relations between the two parties. So how will the war in Gaza alter relations and long-lasting normalization efforts?"
                        }
                    },
                    {
                        "id": "6qSgwzvIO7",
                        "type": "paragraph",
                        "data": {
                            "text": "On another note, it is essential to reiterate the importance of The Port of Cape Town amidst the ongoing crisis in the Red Sea, as ships are re-routing through it, providing the African region, particularly South Africa, with a unique economic opportunity. As trade shifts from the Suez Canal route to the Cape of Good Hope, the demand for bunkering and restocking services at certain African ports has increased drastically. However, inefficiencies, clogging, and power supply issues have prevented major African ports from fully exploiting the economic benefits of the increase in trade around the Cape of Good Hope. Consequently, this has altered the focus of African Policymakers to invest in port development strategies that will help build intra-African and international connectivity, resulting in increased efficiency and economic benefit during the upcoming years. However, it is important to note that, regardless of the economic benefits South Africa has been acquiring to the shift in Trade routes, it has shown great solidarity with the Palestinian community and advocated for a ceasefire. In fact, South Africa has filed an official case at the International Court of Justice (ICJ) accusing Israel of genocide in Gaza."
                        }
                    },
                    {
                        "id": "pAzfhqeMKH",
                        "type": "paragraph",
                        "data": {
                            "text": "From a global perspective, The United States' position concerning a ceasefire agreement during the Gaza conflict has gradually changed, reflecting shifts in diplomatic priorities and global conditions. At first, the U.S. administration made a point of clearly endorsing Israel's right to self-defense against Hamas. However, as the number of civilian deaths in Gaza increased and international pressure for an end to hostilities grew, American policy started to change. Diplomatic efforts led by the United Nations and other relevant parties gathered steam, leading the United States to change its approach towards a ceasefire agreement. After using its veto power three times to block Security Council resolutions that pressure Israel and call for a ceasefire agreement in Gaza, the US has allowed the passage of the latest Security Council resolution by abstaining from the vote."
                        }
                    }
                ],
                "version": "2.30.2"
            }
        ],
        "tags": [
            "mena",
            "war",
            "boycott",
            "lebanon",
            "saudi arabia",
            "palestine",
            "usa"
        ],
        "author": {
            "personal_info": {
                "name": "ali m. moumneh",
                "username": "ali2",
                "profile_img": "http://res.cloudinary.com/dlhedrwu6/image/upload/v1733085425/VNu1WhaSG6u0V-RZ1Jb45-1733085425139.jpg"
            },
            "_id": "66b3b7d63cab83b43bddd060"
        },
        "publishedAt": "2025-02-09T09:05:30.765Z"
    },
  {
        "activity": {
            "total_reads": 2
        },
        "_id": "67a8708c0e17a292d575dfc1",
        "blog_id": "Economic-Warfare-The-Implications-of-the-Red-Sea-Attacks-on-International-Trade7DHy1uYU9m7zzVzaERYEu",
        "title": "Economic Warfare: The Implications of the Red Sea Attacks on International Trade",
        "banner": "http://res.cloudinary.com/dlhedrwu6/image/upload/v1739092019/2wzfFrik90KYHg3WcEKed-1739092019661.jpg",
        "description": "International shipping disruptions, including the ongoing Red Sea and Suez Canal disruption, Panama Canal constraints, and Ukraine's war in the Black Sea, could reshape global maritime networks and...",
        "content": [
            {
                "time": 1739092075562,
                "blocks": [
                    {
                        "id": "R2vUDAb3E3",
                        "type": "quote",
                        "data": {
                            "text": "On 19 November, the Houthis hijacked a commercial ship in the Red Sea. They have since launched dozens of missile and drone attacks on commercial ships. Of these, 34 have resulted in reported damage to vessels",
                            "caption": "BBC, 2023.",
                            "alignment": "left"
                        }
                    },
                    {
                        "id": "iY5__jh8A3",
                        "type": "paragraph",
                        "data": {
                            "text": "International shipping disruptions, including the ongoing Red Sea and Suez Canal disruption, Panama Canal constraints, and Ukraine's war in the Black Sea, could reshape global maritime networks and reconfigure the world trading map, potentially leading to greater supply chain upheaval, which has several effects on different levels."
                        }
                    },
                    {
                        "id": "si8lWloT2k",
                        "type": "paragraph",
                        "data": {
                            "text": "On an international level, a single attack on commercial shipping globally impacts international business, affecting ships built in Korea, crewed by Filipino seafarers, owned by German investment funds, inspected by Indian classification societies, registered under the Marshall Islands flag, insured in Norway, and fueled in Singapore."
                        }
                    },
                    {
                        "id": "y7MvdGkr8c",
                        "type": "paragraph",
                        "data": {
                            "text": "On the level of trade microeconomics, Brad Martin, a US Navy Captain stated that: \"Flow through the Mediterranean will likely continue unimpeded. Israel is probably in a better position for absorbing disruption than most of its neighbors. However, shipping and trade can become subject to diplomatic and political action, so economically damaging isolation could certainly occur on that front” (Aljazeera, 2024). However, as of mid-December, Israel’s only Red Sea Port, at Eilat, reported an 85 percent drop in activity since the attacks began (Aljazeera, 2024). Based on a rapid assessment published by UNCTAD in February 2024, monthly transits dropped by around 50% in the Panama Canal and 42% in the Suez Canal."
                        }
                    },
                    {
                        "id": "euq4XquFfp",
                        "type": "paragraph",
                        "data": {
                            "text": "In 2023, 22 percent of global seaborne container trade is estimated to have transited through the Canal, including liquified natural gas carriers, oil tankers, liquified petroleum gas carriers, car carriers, and bulkers. However, the response was immediate where many transits have been transferred from the Suez to the Cape of Good Hope. The Gulf of Eden experienced a 70% decline in ship tonnage between December 2023 and February 2024, while vessel tonnage passing through the Cape of Good Hope increased by 60%, with 621 container ships rerouting."
                        }
                    },
                    {
                        "id": "XN8uPbjyFc",
                        "type": "paragraph",
                        "data": {
                            "text": "It is important to note that the Panama Canal is particularly important for the foreign trade of countries on the West Coast of South America. In fact, approximately, 22% of the Chilean foreign trade, 22% of that of Peru, and 26% of Ecuador’s foreign trade is channeled through Panama."
                        }
                    },
                    {
                        "id": "tPmsH9gciH",
                        "type": "paragraph",
                        "data": {
                            "text": "Similarly, Egypt's Suez Canal, a significant foreign currency revenue source, has experienced a 40% drop due to the Red Sea crisis and attacks, potentially impacting Ethiopia and Sudan, and potentially causing negative spillover effects. The Suez Canal channels 31% of the foreign trade of Djibouti, 15% of Kenya, 12% of the Republic of Tanzania, 34% of Sudan, 31% of Yemen, and only 7% of German foreign trade."
                        }
                    },
                    {
                        "id": "WAydJoSsYD",
                        "type": "paragraph",
                        "data": {
                            "text": "As a result, trade trips have started rerouting to an older pathway: The Cape of Good Hope. With already existing shifts in the path of trade, maritime cargo travels have increased due to global trade shifts and globalization trends, with the Red Sea conflict and Ukraine war exacerbated. Grain to Egypt now comes from Brazil or the US, while Russian oil shipments go to India and China. Since the Suez Canal path cuts around 40% of the distance along the Cape of Good Hope, several rerouting effects have been displayed. To explain, increased distances in shipping markets lead to increased ton-mile demand, such as container shipping, oil tanker rerouting, and liquified natural gas-carrying vessels diverting away from the Suez Canal. Bulk trade has limited market impacts, but bulker ship capacity has been diverted. Grain and soybean flows have been affected, and the number of specialized car-carrying ships using the Red Sea has been cut by over half. Vessel prices and charter rates have also increased since December 2023."
                        }
                    },
                    {
                        "id": "XNy3Wu5ggY",
                        "type": "paragraph",
                        "data": {
                            "text": "On the level of international macroeconomics, The Suez gateway interruption is causing inflationary pressure due to soaring food and energy prices. Container shipping disruptions pose a threat to global supply chains, potentially leading to delayed deliveries, increased costs, and inflation. Current container freight rates are half the peak recorded during the COVID crisis, but sustained increases can drive up inflation. The crisis is also affecting global food prices, with disruptions in grain shipments from Russia, Ukraine, and Europe affecting consumers and lowering producer prices. The war in Ukraine has already shown the impact of longer distances and freight rates on food prices. Inflation rates in Europe reached a peak in October 2023, and interest rates have been increasing to combat inflation."
                        }
                    }
                ],
                "version": "2.30.2"
            }
        ],
        "tags": [
            "economy",
            "mena",
            "warfare"
        ],
        "author": {
            "personal_info": {
                "name": "ali m. moumneh",
                "username": "ali2",
                "profile_img": "http://res.cloudinary.com/dlhedrwu6/image/upload/v1733085425/VNu1WhaSG6u0V-RZ1Jb45-1733085425139.jpg"
            },
            "_id": "66b3b7d63cab83b43bddd060"
        },
        "publishedAt": "2025-02-09T09:08:28.622Z"
}
]
